lilihang123/AB162XM_project/modules/hal/nxp/mcux/mcux-sdk/devices/MIMXRT555S/drivers/fsl_iap.h
/*!@brief FlexSPI Transfer Context */
typedef struct _FlexSpiXfer
{
    flexspi_operation_t operation; /*!< FlexSPI operation */
    uint32_t baseAddress;          /*!< FlexSPI operation base address */
    uint32_t seqId;                /*!< Sequence Id */
    uint32_t seqNum;               /*!< Sequence Number */
    bool isParallelModeEnable;     /*!< Is a parallel transfer */
    uint32_t *txBuffer;            /*!< Tx buffer */
    uint32_t txSize;               /*!< Tx size in bytes */
    uint32_t *rxBuffer;            /*!< Rx buffer */
    uint32_t rxSize;               /*!< Rx size in bytes */
} flexspi_xfer_t;

/*!@brief Serial NOR configuration block */
typedef struct _flexspi_nor_config
{
    flexspi_mem_config_block_t memConfig; /*!< Common memory configuration info via FlexSPI */
    uint32_t pageSize;                    /*!< Page size of Serial NOR */
    uint32_t sectorSize;                  /*!< Sector size of Serial NOR */
    uint8_t ipcmdSerialClkFreq;           /*!< Clock frequency for IP command */
    uint8_t isUniformBlockSize;           /*!< Sector/Block size is the same */
    uint8_t isDataOrderSwapped;           /*!< Data order (D0, D1, D2, D3) is swapped (D1,D0, D3, D2) */
    uint8_t reserved0[1];                 /*!< Reserved for future use */
    uint8_t serialNorType;                /*!< Serial NOR Flash type: 0/1/2/3 */
    uint8_t needExitNoCmdMode;            /*!< Need to exit NoCmd mode before other IP command */
    uint8_t halfClkForNonReadCmd;         /*!< Half the Serial Clock for non-read command: true/false */
    uint8_t needRestoreNoCmdMode;         /*!< Need to Restore NoCmd mode after IP commmand execution */
    uint32_t blockSize;                   /*!< Block size */
    uint32_t flashStateCtx;               /*!< Flash State Context */
    uint32_t reserve2[10];                /*!< Reserved for future use */
} flexspi_nor_config_t;
/*! @} */

/*!
 * @addtogroup iap_otp_driver
 * @{
 */

/*! @brief OTP Status Group */
enum
{
    kStatusGroup_OtpGroup = 0x210,
};

/*! @brief OTP Error Status definitions */
enum
{
    kStatus_OTP_InvalidAddress = MAKE_STATUS(kStatusGroup_OtpGroup, 1), /*!< Invalid OTP address */
    kStatus_OTP_ProgramFail    = MAKE_STATUS(kStatusGroup_OtpGroup, 2), /*!< Program Fail */
    kStatus_OTP_CrcFail        = MAKE_STATUS(kStatusGroup_OtpGroup, 3), /*!< CrcCheck Fail */
    kStatus_OTP_Error          = MAKE_STATUS(kStatusGroup_OtpGroup, 4), /*!< Errors happened during OTP operation */
    kStatus_OTP_EccCheckFail   = MAKE_STATUS(kStatusGroup_OtpGroup, 5), /*!< Ecc Check failed during OTP operation */
    kStatus_OTP_Locked         = MAKE_STATUS(kStatusGroup_OtpGroup, 6), /*!< OTP Fuse field has been locked */
    kStatus_OTP_Timeout        = MAKE_STATUS(kStatusGroup_OtpGroup, 7), /*!< OTP operation time out */
    kStatus_OTP_CrcCheckPass   = MAKE_STATUS(kStatusGroup_OtpGroup, 8), /*!< OTP CRC Check Pass */
};
/*! @} */

/*!
 * @addtogroup iap_boot_driver
 * @{
 */

/*! @brief IAP boot option. */
typedef struct _iap_boot_option
{
    union
    {
        struct
        {
            uint32_t reserved : 8;       /*! reserved field. */
            uint32_t bootImageIndex : 4; /*! FlexSPI boot image index for FlexSPI NOR flash. */
            uint32_t instance : 4;       /*! Only used when boot interface is FlexSPI/SD/MMC. */
            uint32_t bootInterface : 4;  /*! RT500: 0: USART 2: SPI 3: USB HID 4:FlexSPI 6:SD 7:MMC.
                                             RT600: 0: USART 1: I2C 2: SPI 3: USB HID 4:FlexSPI 7:SD 8:MMC*/
            uint32_t mode : 4;           /* boot mode, 0: Master boot mode; 1: ISP boot */
            uint32_t tag : 8;            /*! tag, should always be "0xEB". */
        } B;
        uint32_t U;
    } option;
} iap_boot_option_t;

/*! IAP boot option tag */
#define IAP_BOOT_OPTION_TAG (0xEBU)
/*! IAP boot option mode */
#define IAP_BOOT_OPTION_MODE_MASTER (0U)
#define IAP_BOOT_OPTION_MODE_ISP    (1U)

/*! @} */

/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @addtogroup iap_boot_driver
 * @{
 */

/*!
 * @brief Invoke into ROM with specified boot parameters.
 *
 * @param option Boot parameters. Refer to #iap_boot_option_t.
 */
void IAP_RunBootLoader(iap_boot_option_t *option);
/*! @} */

/*!
 * @addtogroup iap_flexspi_driver
 * @{
 */

/*!
 * @brief Initialize Serial NOR devices via FlexSPI.
 *
 * This function configures the FlexSPI controller with the arguments pointed by param config.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param config The Flash configuration block. Refer to #flexspi_nor_config_t.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
#if defined(DOXYGEN_OUTPUT) && DOXYGEN_OUTPUT
status_t IAP_FlexspiNorInit(uint32_t instance, flexspi_nor_config_t *config);
#else
AT_QUICKACCESS_SECTION_CODE(status_t IAP_FlexspiNorInit(uint32_t instance, flexspi_nor_config_t *config));
#endif

/*!
 * @brief Program data to Serial NOR via FlexSPI.
 *
 * This function Program data to specified destination address.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param config The Flash configuration block. Refer to #flexspi_nor_config_t.
 * @param dstAddr The destination address to be programmed.
 * @param src Points to the buffer which hold the data to be programmed.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiNorPageProgram(uint32_t instance,
                                   flexspi_nor_config_t *config,
                                   uint32_t dstAddr,
                                   const uint32_t *src);

/*!
 * @brief Erase all the Serial NOR devices connected on FlexSPI.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param config The Flash configuration block. Refer to #flexspi_nor_config_t.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiNorEraseAll(uint32_t instance, flexspi_nor_config_t *config);

/*!
 * @brief Erase Flash Region specified by address and length.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param config The Flash configuration block. Refer to #flexspi_nor_config_t.
 * @param start The start address to be erased.
 * @param length The length to be erased.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiNorErase(uint32_t instance, flexspi_nor_config_t *config, uint32_t start, uint32_t length);

/*!
 * @brief Erase one sector specified by address.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param config The Flash configuration block. Refer to #flexspi_nor_config_t.
 * @param address The address of the sector to be erased.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiNorEraseSector(uint32_t instance, flexspi_nor_config_t *config, uint32_t address);

/*!
 * @brief Erase one block specified by address.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param config The Flash configuration block. Refer to #flexspi_nor_config_t.
 * @param address The address of the block to be erased.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiNorEraseBlock(uint32_t instance, flexspi_nor_config_t *config, uint32_t address);

/*!
 * @brief Get FlexSPI NOR Configuration Block based on specified option.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param config The Flash configuration block. Refer to #flexspi_nor_config_t.
 * @param option The Flash Configuration Option block. Refer to #serial_nor_config_option_t.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiNorGetConfig(uint32_t instance, flexspi_nor_config_t *config, serial_nor_config_option_t *option);

/*!
 * @brief Read data from Flexspi NOR Flash.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param config The Flash configuration block. Refer to #flexspi_nor_config_t.
 * @param dst Buffer address used to store the read data.
 * @param start The Read address.
 * @param bytes The Read size
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiNorRead(
    uint32_t instance, flexspi_nor_config_t *config, uint32_t *dst, uint32_t start, uint32_t bytes);

/*!
 * @brief Get FlexSPI Xfer data.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param xfer The FlexSPI Transfer Context block. Refer to #flexspi_xfer_t.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiXfer(uint32_t instance, flexspi_xfer_t *xfer);

/*!
 * @brief Update FlexSPI Lookup table.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param seqIndex The index of FlexSPI LUT to be updated.
 * @param lutBase Points to the buffer which hold the LUT data to be programmed.
 * @param numberOfSeq The number of LUT seq that need to be updated.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiUpdateLut(uint32_t instance, uint32_t seqIndex, const uint32_t *lutBase, uint32_t numberOfSeq);

/*!
 * @brief Set the clock source for FlexSPI.
 *
 * @param clockSrc Clock source for flexspi interface.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
status_t IAP_FlexspiSetClockSource(uint32_t clockSrc);

/*!
 * @brief Configure the flexspi interface clock frequency and data sample mode.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param freqOption FlexSPI interface clock frequency selection.
 * @param sampleClkMode FlexSPI controller data sample mode.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
void IAP_FlexspiConfigClock(uint32_t instance, uint32_t freqOption, uint32_t sampleClkMode);

/*!
 * @brief Configure flexspi nor automatically.
 *
 * @param instance FlexSPI controller instance, only support 0.
 * @param config The Flash configuration block. Refer to #flexspi_nor_config_t.
 * @param option The Flash Configuration Option block. Refer to #serial_nor_config_option_t.
 * @return The status flags. This is a member of the
 *         enumeration ::_flexspi_status
 */
#if defined(DOXYGEN_OUTPUT) && DOXYGEN_OUTPUT
status_t IAP_FlexspiNorAutoConfig(uint32_t instance, flexspi_nor_config_t *config, serial_nor_config_option_t *option);
#else
AT_QUICKACCESS_SECTION_CODE(status_t IAP_FlexspiNorAutoConfig(uint32_t instance,
                                                              flexspi_nor_config_t *config,
                                                              serial_nor_config_option_t *option));
#endif
/*! @} */

/*!
 * @addtogroup iap_otp_driver
 * @{
 */

/*!
 * @brief Initialize OTP controller
 *
 * This function enables OTP Controller clock.
 *
 * @param src_clk_freq The Frequency of the source clock of OTP controller
 * @return kStatus_Success
 */
status_t IAP_OtpInit(uint32_t src_clk_freq);

/*!
 * @brief De-Initialize OTP controller
 *
 * This functin disables OTP Controller Clock.
 * @return kStatus_Success
 */
status_t IAP_OtpDeinit(void);

/*!
 * @brief Read Fuse value from OTP Fuse Block
 *
 * This function read fuse data from OTP Fuse block to specified data buffer.
 *
 * @param addr Fuse address
 * @param data Buffer to hold the data read from OTP Fuse block
 * @return kStatus_Success - Data read from OTP Fuse block successfully
 *         kStatus_InvalidArgument - data pointer is invalid
 *         kStatus_OTP_EccCheckFail - Ecc Check Failed
 *         kStatus_OTP_Error - Other Errors
 */
status_t IAP_OtpFuseRead(uint32_t addr, uint32_t *data);

/*!
 * @brief Program value to OTP Fuse block
 *
 * This function program data to specified OTP Fuse address.
 *
 * @param addr Fuse address
 * @param data data to be programmed into OTP Fuse block
 * @param lock lock the fuse field or not
 * @return kStatus_Success - Data has been programmed into OTP Fuse block successfully
 *         kStatus_OTP_ProgramFail - Fuse programming failed
 *         kStatus_OTP_Locked - The address to be programmed into is locked
 *         kStatus_OTP_Error - Other Errors
 */
status_t IAP_OtpFuseProgram(uint32_t addr, uint32_t data, bool lock);

/*!
 * @brief Reload all shadow registers from OTP fuse block
 *
 * This function reloads all the shadow registers from OTP Fuse block
 *
 * @return kStatus_Success - Shadow registers' reloadding succeeded.
 *         kStatus_OTP_EccCheckFail - Ecc Check Failed
 *         kStatus_OTP_Error - Other Errors
 */
status_t IAP_OtpShadowRegisterReload(void);

/*!
 * @brief Do CRC Check via OTP controller
 *
 * This function checks whether data in specified fuse address ranges match the crc value in the specified CRC address
 *  and return the actual crc value as needed.
 *
 * @param start_addr Start address of selected Fuse address range
 * @param end_addr   End address of selected Fuse address range
 * @param crc_addr   Address that hold CRC data
 *
 * @return kStatus_Success CRC check succeeded, CRC value matched.
 *         kStatus_InvalidArgument - Invalid Argument
 *         kStatus_OTP_EccCheckFail Ecc Check Failed
 *         kStatus_OTP_CrcFail CRC Check Failed
 */
status_t IAP_OtpCrcCheck(uint32_t start_addr, uint32_t end_addr, uint32_t crc_addr);

/*!
 * @brief Calculate the CRC checksum for specified data for OTP
 *
 * This function calculates the CRC checksum for specified data for OTP
 *
 * @param src the source address of data
 * @param numberOfWords number of Fuse words
 * @param crcChecksum   Buffer to store the CRC checksum
 *
 * @return kStatus_Success CRC checksum is computed successfully.
 *         kStatus_InvalidArgument - Invalid Argument
 */
status_t IAP_OtpCrcCalc(uint32_t *src, uint32_t numberOfWords, uint32_t *crcChecksum);
/*! @} */
#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* FSL_IAP_H_ */
